MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/** @defgroup LPTIM_LL_EC_LPTIM_IC_PRESCALER Input Capture Prescaler
  * @{
  */
#define LL_LPTIM_ICPSC_DIV1                   0x00000000UL                                /*!< Capture performed each
                                                                                               time an edge is detected
                                                                                               on the capture input. */
#define LL_LPTIM_ICPSC_DIV2                   LPTIM_CCMR1_IC1PSC_0                        /*!< Capture performed once
                                                                                               every 2 events.      */
#define LL_LPTIM_ICPSC_DIV4                   LPTIM_CCMR1_IC1PSC_1                        /*!< Capture performed once
                                                                                               every 4 events.      */
#define LL_LPTIM_ICPSC_DIV8                   (LPTIM_CCMR1_IC1PSC_0|LPTIM_CCMR1_IC1PSC_1) /*!< Capture performed once
                                                                                               every 8 events.      */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_LPTIM_IC_FILTER Input Capture Filter
  * @{
  */
#define LL_LPTIM_ICFLT_CLOCK_DIV1             0x00000000UL                            /*!< Any external input capture
                                                                                           signal level change is
                                                                                           considered a valid
                                                                                           transition.      */
#define LL_LPTIM_ICFLT_CLOCK_DIV2             LPTIM_CCMR1_IC1F_0                      /*!< External input capture signal
                                                                                           level change must be stable
                                                                                           for at least 2 clock periods
                                                                                           before it is considered a
                                                                                           valid transition. */
#define LL_LPTIM_ICFLT_CLOCK_DIV4             LPTIM_CCMR1_IC1F_1                      /*!< External input capture signal
                                                                                           level change must be stable
                                                                                           for at least 4 clock periods
                                                                                           before it is considered a
                                                                                           valid transition. */
#define LL_LPTIM_ICFLT_CLOCK_DIV8             (LPTIM_CCMR1_IC1F_0|LPTIM_CCMR1_IC1F_1) /*!< External input capture signal
                                                                                           level change must be stable
                                                                                           for at least 8 clock periods
                                                                                           before it is considered a
                                                                                           valid transition. */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_LPTIM_IC_POLARITY  Input Capture Polarity
  * @{
  */
#define LL_LPTIM_ICPOLARITY_RISING            0x00000000UL                            /*!< Capture/Compare input rising
                                                                                           polarity.              */
#define LL_LPTIM_ICPOLARITY_FALLING           LPTIM_CCMR1_CC1P_0                      /*!< Capture/Compare input falling
                                                                                           polarity.              */
#define LL_LPTIM_ICPOLARITY_RISING_FALLING    (LPTIM_CCMR1_CC1P_0|LPTIM_CCMR1_CC1P_1) /*!< Capture/Compare input rising
                                                                                           and falling polarities. */
/**
  * @}
  */
/** @defgroup LPTIM_LL_EC_LPTIM_IC_Selection  Input Capture selection
  * @{
  */
#define LL_LPTIM_CCMODE_OUTPUT_PWM            0x00000000UL                              /*!< Select PWM mode.         */
#define LL_LPTIM_CCMODE_INPUTCAPTURE          LPTIM_CCMR1_CC1SEL                        /*!< Select input capture mode. */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_PRESCALER Prescaler Value
  * @{
  */
#define LL_LPTIM_PRESCALER_DIV1               0x00000000U                               /*!< Prescaler division factor
                                                                                            is set to 1.  */
#define LL_LPTIM_PRESCALER_DIV2               LPTIM_CFGR_PRESC_0                        /*!< Prescaler division factor
                                                                                            is set to 2.  */
#define LL_LPTIM_PRESCALER_DIV4               LPTIM_CFGR_PRESC_1                        /*!< Prescaler division factor
                                                                                            is set to 4.  */
#define LL_LPTIM_PRESCALER_DIV8               (LPTIM_CFGR_PRESC_1 | LPTIM_CFGR_PRESC_0) /*!< Prescaler division factor
                                                                                            is set to 8.  */
#define LL_LPTIM_PRESCALER_DIV16              LPTIM_CFGR_PRESC_2                        /*!< Prescaler division factor
                                                                                            is set to 16. */
#define LL_LPTIM_PRESCALER_DIV32              (LPTIM_CFGR_PRESC_2 | LPTIM_CFGR_PRESC_0) /*!< Prescaler division factor
                                                                                            is set to 32. */
#define LL_LPTIM_PRESCALER_DIV64              (LPTIM_CFGR_PRESC_2 | LPTIM_CFGR_PRESC_1) /*!< Prescaler division factor
                                                                                            is set to 64. */
#define LL_LPTIM_PRESCALER_DIV128             LPTIM_CFGR_PRESC                          /*!< Prescaler division factor
                                                                                            is set to 128. */
/**
  * @}
  */


/** @defgroup LPTIM_LL_EC_TRIG_SOURCE Trigger Source
  * @{
  */

#define LL_LPTIM_TRIG_SOURCE_GPIO            0x00000000U                                                /*!<External input trigger is connected to TIMx_ETR input*/
#define LL_LPTIM_TRIG_SOURCE_RTC_ALRA_TRG    LPTIM_CFGR_TRIGSEL_0                                       /*!<External input trigger is connected to RTC Alarm A*/
#define LL_LPTIM_TRIG_SOURCE_RTC_ALRB_TRG    LPTIM_CFGR_TRIGSEL_1                                       /*!<External input trigger is connected to RTC Alarm B*/
#define LL_LPTIM_TRIG_SOURCE_TAMP_TRG1       (LPTIM_CFGR_TRIGSEL_1 | LPTIM_CFGR_TRIGSEL_0)              /*!<External input trigger is connected to RTC Tamper 1*/
#define LL_LPTIM_TRIG_SOURCE_TAMP_TRG2       LPTIM_CFGR_TRIGSEL_2                                       /*!<External input trigger is connected to RTC Tamper 2*/
#define LL_LPTIM_TRIG_SOURCE_LPDMA_CH1_TC    (LPTIM_CFGR_TRIGSEL_2  | LPTIM_CFGR_TRIGSEL_0)             /*!<External input trigger is connected to GPDMA CH1 transfer complete */
#define LL_LPTIM_TRIG_SOURCE_COMP1_OUT       (LPTIM_CFGR_TRIGSEL_2  | LPTIM_CFGR_TRIGSEL_1)             /*!<External input trigger is connected to COMP1 output*/
#define LL_LPTIM_TRIG_SOURCE_EVENTOUT        LPTIM_CFGR_TRIGSEL                                         /*!<External input trigger is connected to PLAYOUT*/

/**
  * @}
  */


/** @defgroup LPTIM_LL_EC_TRIG_FILTER Trigger Filter
  * @{
  */
#define LL_LPTIM_TRIG_FILTER_NONE             0x00000000U         /*!< Any trigger active level change is considered
                                                                      a valid trigger. */
#define LL_LPTIM_TRIG_FILTER_2                LPTIM_CFGR_TRGFLT_0 /*!< Trigger active level change must be stable for
                                                                      at least 2 clock periods before it is considered
                                                                      a valid trigger. */
#define LL_LPTIM_TRIG_FILTER_4                LPTIM_CFGR_TRGFLT_1 /*!< Trigger active level change must be stable for at
                                                                      least 4 clock periods before it is considered
                                                                      a valid trigger. */
#define LL_LPTIM_TRIG_FILTER_8                LPTIM_CFGR_TRGFLT   /*!< Trigger active level change must be stable for at
                                                                      least 8 clock periods before it is considered as
                                                                      valid trigger */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_TRIG_POLARITY Trigger Polarity
  * @{
  */
#define LL_LPTIM_TRIG_POLARITY_RISING         LPTIM_CFGR_TRIGEN_0 /*!< LPTIM counter starts when
                                                                      a rising edge is detected              */
#define LL_LPTIM_TRIG_POLARITY_FALLING        LPTIM_CFGR_TRIGEN_1 /*!< LPTIM counter starts when
                                                                      a falling edge is detected             */
#define LL_LPTIM_TRIG_POLARITY_RISING_FALLING LPTIM_CFGR_TRIGEN   /*!< LPTIM counter starts when
                                                                      a rising or a falling edge is detected */
/**
  * @}
  */

