MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/** @defgroup LPTIM_LL_EC_CLK_SOURCE Clock Source
  * @{
  */
#define LL_LPTIM_CLK_SOURCE_INTERNAL          0x00000000U      /*!< LPTIM is clocked by internal clock source
                                                                   (APB clock or any of the embedded oscillators) */
#define LL_LPTIM_CLK_SOURCE_EXTERNAL          LPTIM_CFGR_CKSEL /*!< LPTIM is clocked by an external clock source through
                                                                   the LPTIM external Input1*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_FILTER Clock Filter
  * @{
  */
#define LL_LPTIM_CLK_FILTER_NONE              0x00000000U        /*!< Any external clock signal level change is
                                                                     considered as a valid transition */
#define LL_LPTIM_CLK_FILTER_2                 LPTIM_CFGR_CKFLT_0 /*!< External clock signal level change must be stable
                                                                     for at least 2 clock periods before it is
                                                                     considered as valid transition   */
#define LL_LPTIM_CLK_FILTER_4                 LPTIM_CFGR_CKFLT_1 /*!< External clock signal level change must be stable
                                                                     for at least 4 clock periods before it is
                                                                     considered as valid transition   */
#define LL_LPTIM_CLK_FILTER_8                 LPTIM_CFGR_CKFLT   /*!< External clock signal level change must be stable
                                                                     for at least 8 clock periods before it is
                                                                     considered as valid transition   */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_POLARITY Clock Polarity
  * @{
  */
#define LL_LPTIM_CLK_POLARITY_RISING          0x00000000U        /*!< The rising edge is the active
                                                                      edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active
                                                                      edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active edges*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_ENCODER_MODE Encoder Mode
  * @{
  */
#define LL_LPTIM_ENCODER_MODE_RISING          0x00000000U        /*!< The rising edge is the active
                                                                      edge used for counting.    */
#define LL_LPTIM_ENCODER_MODE_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active
                                                                      edge used for counting.    */
#define LL_LPTIM_ENCODER_MODE_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active.     */
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_ENCODER_MODE_ENABLE Encoder Mode Enable
  * @{
  */
#define LL_LPTIM_ENCODER_MODE_ENABLE         LPTIM_CFGR_ENC
#define LL_LPTIM_ENCODER_MODE_DISABLE        (~LL_LPTIM_ENCODER_MODE_ENABLE)
/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT1_SRC Input1 Source
  * @{
  */
#define LL_LPTIM_INPUT1_SRC_GPIO         0x00000000UL                 /*!< For LPTIM1 */
#define LL_LPTIM_INPUT1_SRC_COMP1_OUT    LPTIM_CFGR2_IN1SEL_0         /*!< For LPTIM1 */

/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT2_SRC Input2 Source
  * @{
  */
#define LL_LPTIM_INPUT2_SRC_GPIO         0x00000000UL                 /*!< For LPTIM1 */

#if defined(COMP2)
#define LL_LPTIM_INPUT2_SRC_COMP2_OUT    LPTIM_CFGR2_IN2SEL_0         /*!< For LPTIM1 */
#endif /* COMP2 */

/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC1_RMP LPTIM1 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC1_RMP_GPIO         0x00000000UL                                  /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC1_RMP_COMP1_OUT    LPTIM_CFGR2_IC1SEL_0                          /*!< IC1 connected to COMP1 */
#define LL_LPTIM_LPTIM1_IC1_RMP_EVENTOUT     LPTIM_CFGR2_IC1SEL_1                          /*!< IC1 connected to EVENTOUT */
#define LL_LPTIM_LPTIM1_IC1_RMP_MCO1         (LPTIM_CFGR2_IC1SEL_1 | LPTIM_CFGR2_IC1SEL_0) /*!< IC1 connected to MCO1 */

/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC2_RMP LPTIM1 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC2_RMP_GPIO         0x00000000UL                                  /*!< IC2 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC2_RMP_LSI          LPTIM_CFGR2_IC2SEL_0                          /*!< IC2 connected to LSI */
#define LL_LPTIM_LPTIM1_IC2_RMP_LSE          LPTIM_CFGR2_IC2SEL_1                          /*!< IC2 connected to LSE */
#define LL_LPTIM_LPTIM1_IC2_RMP_RCC_HSE_1MHZ (LPTIM_CFGR2_IC2SEL_1 | LPTIM_CFGR2_IC2SEL_0) /*!< IC2 connected to HSE 1MHZ */

/**
  * @}
  */


/**
  * @brief List of all interrupt flags.
  */
#define LL_LPTIM_FLAG_ALL    \
  (LL_LPTIM_ISR_CC1OF   | \
   LL_LPTIM_ISR_CC2OF   | \
   LL_LPTIM_ISR_CC1IF   | \
   LL_LPTIM_ISR_CC2IF   | \
   LL_LPTIM_ISR_CMP1OK  | \
   LL_LPTIM_ISR_CMP2OK  | \
   LL_LPTIM_ISR_DIEROK  | \
   LL_LPTIM_ISR_REPOK   | \
   LL_LPTIM_ISR_UE      | \
   LL_LPTIM_ISR_DOWN    | \
   LL_LPTIM_ISR_UP      | \
   LL_LPTIM_ISR_ARROK   | \
   LL_LPTIM_ISR_EXTTRIG | \
   LL_LPTIM_ISR_ARRM)

/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/
/** @defgroup LPTIM_LL_Exported_Macros LL LPTIM Macros
  * @{
  */

/** @defgroup LPTIM_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value to the LPTIM register.
  * @param  instance LPTIM instance.
  * @param  reg Register to be written.
  * @param  value Value to be written in the register.
  */
#define LL_LPTIM_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value from the LPTIM register.
  * @param  instance LPTIM instance.
  * @param  reg Register to be read.
  * @retval Register value.
  */
#define LL_LPTIM_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup LPTIM_LL_Exported_Functions LL LPTIM Functions
  * @{
  */


/** @defgroup LPTIM_LL_EF_LPTIM_Configuration LPTIM Configuration
  * @{
  */

/**
  * @brief  Enable the LPTIM instance.
  * @rmtoll
  *  CR           ENABLE        LL_LPTIM_Enable
  * @param  lptimx Low-Power Timer instance.
  * @note After setting the ENABLE bit, a delay of two counter clocks is needed
  *       before the LPTIM instance is actually enabled.
  */
__STATIC_INLINE void LL_LPTIM_Enable(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->CR, LPTIM_CR_ENABLE);
}

/**
  * @brief  Disable the LPTIM instance.
  * @rmtoll
  *  CR           ENABLE        LL_LPTIM_Disable
  * @param  lptimx Low-Power Timer instance.
  */
__STATIC_INLINE void LL_LPTIM_Disable(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->CR, LPTIM_CR_ENABLE);
}

/**
  * @brief  Indicate whether the LPTIM instance is enabled.
  * @rmtoll
  *  CR           ENABLE        LL_LPTIM_IsEnabled
  * @param  lptimx Low-Power Timer instance.
  * @retval State of the bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabled(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->CR, LPTIM_CR_ENABLE) == LPTIM_CR_ENABLE) ? 1UL : 0UL));
}

/**
  * @brief  Start the LPTIM counter in the desired mode.
  * @rmtoll
  *  CR           CNTSTRT       LL_LPTIM_StartCounter \n
  *  CR           SNGSTRT       LL_LPTIM_StartCounter
  * @param  lptimx Low-Power Timer instance.
  * @param  operating_mode This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_OPERATING_MODE_CONTINUOUS
  *         @arg @ref LL_LPTIM_OPERATING_MODE_ONESHOT
  * @note Enable the LPTIM instance before starting the counter.
  * @note It is possible to change on the fly from One Shot mode to
  *       Continuous mode.
  */
__STATIC_INLINE void LL_LPTIM_StartCounter(LPTIM_TypeDef *lptimx, uint32_t operating_mode)
{
  STM32_MODIFY_REG(lptimx->CR, LL_LPTIM_OPERATING_MODE_CONTINUOUS | LL_LPTIM_OPERATING_MODE_ONESHOT, operating_mode);
}

/**
  * @brief  Enable reset after read.
  * @rmtoll
  *  CR           RSTARE        LL_LPTIM_EnableResetAfterRead
  * @param  lptimx Low-Power Timer instance.
  * @note After calling this function, any read access to the LPTIM_CNT
  *       register asynchronously resets the LPTIM_CNT register content.
  */
__STATIC_INLINE void LL_LPTIM_EnableResetAfterRead(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->CR, LPTIM_CR_RSTARE);
}

/**
  * @brief  Disable reset after read.
  * @rmtoll
  *  CR           RSTARE        LL_LPTIM_DisableResetAfterRead
  * @param  lptimx Low-Power Timer instance.
  */
__STATIC_INLINE void LL_LPTIM_DisableResetAfterRead(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->CR, LPTIM_CR_RSTARE);
}

/**
  * @brief  Indicate whether the reset after read feature is enabled.
  * @rmtoll
  *  CR           RSTARE        LL_LPTIM_IsEnabledResetAfterRead
  * @param  lptimx Low-Power Timer instance.
  * @retval State of the bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledResetAfterRead(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->CR, LPTIM_CR_RSTARE) == LPTIM_CR_RSTARE) ? 1UL : 0UL));
}

/**
  * @brief  Reset the LPTIM_CNT counter register (synchronous).
  * @rmtoll
  *  CR           COUNTRST       LL_LPTIM_ResetCounter
  * @param  lptimx Low-Power Timer instance.
  * @note Due to the synchronous nature of this reset, it only takes
  *       place after a synchronization delay of 3 LPTIM core clock cycles
  *       (LPTIM core clock can differ from the APB clock).
  * @note COUNTRST is automatically cleared by hardware.
  */
__STATIC_INLINE void LL_LPTIM_ResetCounter(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->CR, LPTIM_CR_COUNTRST);
}

/**
  * @brief  Set the LPTIM register update mode (enable/disable register preload).
  * @rmtoll
  *  CFGR         PRELOAD       LL_LPTIM_SetUpdateMode
  * @param  lptimx Low-Power Timer instance.
  * @param  update_mode This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_PRELOAD_DISABLED
  *         @arg @ref LL_LPTIM_PRELOAD_ENABLED
  * @note This function must be called when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_SetUpdateMode(LPTIM_TypeDef *lptimx, uint32_t update_mode)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_PRELOAD, update_mode);
}

/**
  * @brief  Get the LPTIM register update mode.
  * @rmtoll
  *  CFGR         PRELOAD       LL_LPTIM_GetUpdateMode
  * @param  lptimx Low-Power Timer instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_PRELOAD_DISABLED
  *         @arg @ref LL_LPTIM_PRELOAD_ENABLED
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetUpdateMode(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_PRELOAD));
}

/**
  * @brief  Set the auto-reload value.
  * @rmtoll
  *  ARR          ARR           LL_LPTIM_SetAutoReload
  * @param  lptimx Low-Power Timer instance.
  * @param  auto_reload Value between Min_Data=0x0001 and Max_Data=0xFFFF.
  * @note The LPTIMx_ARR register content must only be modified when the LPTIM is enabled.
  * @note After a write to the LPTIMx_ARR register, a new write operation to the
  *       same register can only be performed when the previous write operation
  *       is completed. Any successive write before the ARROK flag is set will
  *       lead to unpredictable results.
  * @note The auto-reload value must be strictly greater than the compare value.
  */
__STATIC_INLINE void LL_LPTIM_SetAutoReload(LPTIM_TypeDef *lptimx, uint32_t auto_reload)
{
  STM32_MODIFY_REG(lptimx->ARR, LPTIM_ARR_ARR, auto_reload);
}

/**
  * @brief  Get the current auto-reload value.
  * @rmtoll
  *  ARR          ARR           LL_LPTIM_GetAutoReload
  * @param  lptimx Low-Power Timer instance.
  * @retval Auto-reload value between Min_Data=0x0001 and Max_Data=0xFFFF.
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetAutoReload(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->ARR, LPTIM_ARR_ARR));
}

/**
  * @brief  Set the repetition value.
  * @rmtoll
  *  RCR          REP           LL_LPTIM_SetRepetition
  * @param  lptimx Low-Power Timer instance.
  * @param  repetition Value between Min_Data=0x00 and Max_Data=0xFF.
  * @note The LPTIMx_RCR register content must only be modified when the LPTIM is enabled.
  */
__STATIC_INLINE void LL_LPTIM_SetRepetition(LPTIM_TypeDef *lptimx, uint32_t repetition)
{
  STM32_MODIFY_REG(lptimx->RCR, LPTIM_RCR_REP, repetition);
}

/**
  * @brief  Get the repetition value.
  * @rmtoll
  *  RCR          REP           LL_LPTIM_GetRepetition
  * @param  lptimx Low-Power Timer instance.
  * @retval Repetition value between Min_Data=0x00 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetRepetition(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->RCR, LPTIM_RCR_REP));
}

/**
  * @brief  Enable capture/compare channel.
  * @rmtoll
  *  CCMR1         CC1E          LL_LPTIM_CC_EnableChannel \n
  *  CCMR1         CC2E          LL_LPTIM_CC_EnableChannel
  * @param  lptimx LPTimer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  */
__STATIC_INLINE void LL_LPTIM_CC_EnableChannel(LPTIM_TypeDef *lptimx, uint32_t channel)
{
  STM32_SET_BIT(lptimx->CCMR1, 0x1UL << LL_LPTIM_SHIFT_TAB_CCxE[channel]);
}

/**
  * @brief  Disable capture/compare channel.
  * @rmtoll
  *  CCMR1         CC1E          LL_LPTIM_CC_DisableChannel \n
  *  CCMR1         CC2E          LL_LPTIM_CC_DisableChannel
  * @param  lptimx LPTimer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  */
__STATIC_INLINE void LL_LPTIM_CC_DisableChannel(LPTIM_TypeDef *lptimx, uint32_t channel)
{
  STM32_CLEAR_BIT(lptimx->CCMR1, 0x1UL << LL_LPTIM_SHIFT_TAB_CCxE[channel]);
}

/**
  * @brief  Indicate whether channel is enabled.
  * @rmtoll
  *  CCMR1         CC1E          LL_LPTIM_CC_IsEnabledChannel \n
  *  CCMR1         CC2E          LL_LPTIM_CC_IsEnabledChannel
  * @param  lptimx LPTimer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_CC_IsEnabledChannel(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  return ((STM32_READ_BIT(lptimx->CCMR1, 0x1UL << LL_LPTIM_SHIFT_TAB_CCxE[channel]) ==  \
           (0x1UL << LL_LPTIM_SHIFT_TAB_CCxE[channel])) ? 1UL : 0UL);
}

/**
  * @brief  Set the compare value.
  * @rmtoll
  *  CCR1          CCR1           LL_LPTIM_OC_SetCompareCH1
  * @param  lptimx Low-Power Timer instance
  * @param  compare_value Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @note After a write to the LPTIMx_CCR1 register a new write operation to the
  *       same register can only be performed when the previous write operation
  *       is completed. Any successive write before the CMP1OK flag is set, will
  *       lead to unpredictable results.
  */
__STATIC_INLINE void LL_LPTIM_OC_SetCompareCH1(LPTIM_TypeDef *lptimx, uint32_t compare_value)
{
  STM32_MODIFY_REG(lptimx->CCR1, LPTIM_CCR1_CCR1, compare_value);
}

/**
  * @brief  Get compare value for the selected compare unit.
  * @rmtoll
  *  CCR1         CCR1          LL_LPTIM_OC_GetCompareValue \n
  *  CCR2         CCR2          LL_LPTIM_OC_GetCompareValue
  * @param  lptimx Low-power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval CompareValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetCompareValue(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&lptimx->CCR1) + \
                                                           LL_LPTIM_SHIFT_TAB_CCRx[channel]));
  return (uint32_t)(STM32_READ_REG(*pReg));
}

/**
  * @brief  Get actual compare value.
  * @rmtoll
  *  CCR1          CCR1           LL_LPTIM_OC_GetCompareCH1
  * @param  lptimx Low-Power Timer instance
  * @retval CompareValue Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetCompareCH1(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CCR1, LPTIM_CCR1_CCR1));
}

/**
  * @brief  Set the compare value.
  * @rmtoll
  *  CCR2          CCR2           LL_LPTIM_OC_SetCompareCH2
  * @param  lptimx Low-Power Timer instance
  * @param  compare_value Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @note After a write to the LPTIMx_CCR2 register a new write operation to the
  *       same register can only be performed when the previous write operation
  *       is completed. Any successive write before the CMP2OK flag is set, will
  *       lead to unpredictable results.
  */
__STATIC_INLINE void LL_LPTIM_OC_SetCompareCH2(LPTIM_TypeDef *lptimx, uint32_t compare_value)
{
  STM32_MODIFY_REG(lptimx->CCR2, LPTIM_CCR2_CCR2, compare_value);
}

/**
  * @brief  Get actual compare value.
  * @rmtoll
  *  CCR2          CCR2           LL_LPTIM_OC_GetCompareCH2
  * @param  lptimx Low-Power Timer instance
  * @retval CompareValue Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetCompareCH2(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CCR2, LPTIM_CCR2_CCR2));
}

/**
  * @brief  Get actual counter value.
  * @rmtoll
  *  CNT          CNT           LL_LPTIM_GetCounter
  * @param  lptimx Low-Power Timer instance
  * @note When the LPTIM instance is running with an asynchronous clock, reading
  *       the LPTIMx_CNT register can return unreliable values. In this case,
  *       perform two consecutive read accesses and verify that the two returned
  *       values are identical.
  * @retval Counter value
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetCounter(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CNT, LPTIM_CNT_CNT));
}

/**
  * @brief  Set the counter mode (selection of the LPTIM counter clock source).
  * @rmtoll
  *  CFGR         COUNTMODE     LL_LPTIM_SetCounterMode
  * @param  lptimx Low-Power Timer instance
  * @param  counter_mode This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_COUNTER_MODE_INTERNAL
  *         @arg @ref LL_LPTIM_COUNTER_MODE_EXTERNAL
  * @note The counter mode can be set only when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_SetCounterMode(LPTIM_TypeDef *lptimx, uint32_t counter_mode)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_COUNTMODE, counter_mode);
}

/**
  * @brief  Get the counter mode.
  * @rmtoll
  *  CFGR         COUNTMODE     LL_LPTIM_GetCounterMode
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_COUNTER_MODE_INTERNAL
  *         @arg @ref LL_LPTIM_COUNTER_MODE_EXTERNAL
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetCounterMode(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_COUNTMODE));
}

/**
  * @brief  Set the waveform shape.
  * @rmtoll
  *  CFGR         WAVE          LL_LPTIM_SetWaveform
  * @param  lptimx   Low-Power Timer instance
  * @param  waveform This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_OC_WAVEFORM_PWM
  *         @arg @ref LL_LPTIM_OC_WAVEFORM_SETONCE
  */
__STATIC_INLINE void LL_LPTIM_SetWaveform(LPTIM_TypeDef *lptimx, uint32_t waveform)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_WAVE, waveform);
}

/**
  * @brief  Get actual waveform shape.
  * @rmtoll
  *  CFGR         WAVE          LL_LPTIM_GetWaveform
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_OC_WAVEFORM_PWM
  *         @arg @ref LL_LPTIM_OC_WAVEFORM_SETONCE
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetWaveform(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_WAVE));
}

/**
  * @brief  Set the polarity of an output channel.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_OC_SetPolarity \n
  *  CCMR1         CC2P          LL_LPTIM_OC_SetPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_OCPOLARITY_HIGH
  *         @arg @ref LL_LPTIM_OCPOLARITY_LOW
  */
__STATIC_INLINE void LL_LPTIM_OC_SetPolarity(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t polarity)
{
  {
    STM32_MODIFY_REG(lptimx->CCMR1, (LPTIM_CCMR1_CC1P << LL_LPTIM_SHIFT_TAB_CCxP[channel]), \
                     (polarity << LL_LPTIM_SHIFT_TAB_CCxP[channel]));
  }
}

/**
  * @brief  Get the polarity of an output channel.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_OC_GetPolarity \n
  *  CCMR1         CC2P          LL_LPTIM_OC_GetPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_OCPOLARITY_HIGH
  *         @arg @ref LL_LPTIM_OCPOLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_LPTIM_OC_GetPolarity(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  {
    return (uint32_t)(STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_CC1P << LL_LPTIM_SHIFT_TAB_CCxP[channel]) >> \
                      LL_LPTIM_SHIFT_TAB_CCxP[channel]);
  }
}

/**
  * @brief  Set actual prescaler division ratio.
  * @rmtoll
  *  CFGR         PRESC         LL_LPTIM_SetPrescaler
  * @param  lptimx Low-Power Timer instance
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_PRESCALER_DIV1
  *         @arg @ref LL_LPTIM_PRESCALER_DIV2
  *         @arg @ref LL_LPTIM_PRESCALER_DIV4
  *         @arg @ref LL_LPTIM_PRESCALER_DIV8
  *         @arg @ref LL_LPTIM_PRESCALER_DIV16
  *         @arg @ref LL_LPTIM_PRESCALER_DIV32
  *         @arg @ref LL_LPTIM_PRESCALER_DIV64
  *         @arg @ref LL_LPTIM_PRESCALER_DIV128
  * @note This function must be called when the LPTIM instance is disabled.
  * @note When the LPTIM is configured to be clocked by an internal clock source
  *       and the LPTIM counter is configured to be updated by active edges
  *       detected on the LPTIM external Input1, the internal clock provided to
  *       the LPTIM must be not be prescaled.
  */
__STATIC_INLINE void LL_LPTIM_SetPrescaler(LPTIM_TypeDef *lptimx, uint32_t prescaler)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_PRESC, prescaler);
}

