MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/**
  * @brief  Get actual prescaler division ratio.
  * @rmtoll
  *  CFGR         PRESC         LL_LPTIM_GetPrescaler
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_PRESCALER_DIV1
  *         @arg @ref LL_LPTIM_PRESCALER_DIV2
  *         @arg @ref LL_LPTIM_PRESCALER_DIV4
  *         @arg @ref LL_LPTIM_PRESCALER_DIV8
  *         @arg @ref LL_LPTIM_PRESCALER_DIV16
  *         @arg @ref LL_LPTIM_PRESCALER_DIV32
  *         @arg @ref LL_LPTIM_PRESCALER_DIV64
  *         @arg @ref LL_LPTIM_PRESCALER_DIV128
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetPrescaler(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_PRESC));
}

/**
  * @brief  Set LPTIM input 1 source (default GPIO).
  * @rmtoll
  *  CFGR2      IN1SEL       LL_LPTIM_SetInput1Source
  * @param  lptimx Low-Power Timer instance
  * @param  src This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_INPUT1_SRC_GPIO
  *         @arg @ref LL_LPTIM_INPUT1_SRC_COMP1_OUT
  */
__STATIC_INLINE void LL_LPTIM_SetInput1Source(LPTIM_TypeDef *lptimx, uint32_t src)
{
  STM32_MODIFY_REG(lptimx->CFGR2, LPTIM_CFGR2_IN1SEL, src);
}

/**
  * @brief  Get LPTIM input 1 source.
  * @rmtoll
  *  CFGR2      IN1SEL       LL_LPTIM_GetInput1Source
  * @param  lptimx Low-Power Timer instance
  *         @arg @ref LL_LPTIM_INPUT1_SRC_GPIO
  *         @arg @ref LL_LPTIM_INPUT1_SRC_COMP1_OUT
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetInput1Source(const LPTIM_TypeDef *lptimx)
{
  return (STM32_READ_REG(lptimx->CFGR2) & LPTIM_CFGR2_IN1SEL);
}

/**
  * @brief  Set LPTIM input 2 source (default GPIO).
  * @rmtoll
  *  CFGR2      IN2SEL       LL_LPTIM_SetInput2Source
  * @param  lptimx Low-Power Timer instance
  * @param  src This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_INPUT2_SRC_GPIO
  *         @arg @ref LL_LPTIM_INPUT2_SRC_COMP2_OUT (*)
  *         (*)  Value not defined for all timer instances.
  */
__STATIC_INLINE void LL_LPTIM_SetInput2Source(LPTIM_TypeDef *lptimx, uint32_t src)
{
  STM32_MODIFY_REG(lptimx->CFGR2, LPTIM_CFGR2_IN2SEL, src);
}

/**
  * @brief  Get LPTIM input 2 source (default GPIO).
  * @rmtoll
  *  CFGR2      IN2SEL       LL_LPTIM_GetInput2Source
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_INPUT2_SRC_GPIO
  *         @arg @ref LL_LPTIM_INPUT2_SRC_COMP2_OUT (*)
  *         (*)  Value not defined for all timer instances.
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetInput2Source(const LPTIM_TypeDef *lptimx)
{
  return (STM32_READ_REG(lptimx->CFGR2) & LPTIM_CFGR2_IN2SEL);
}

/**
  * @brief  Set LPTIM input source (default GPIO).
  * @rmtoll
  *  CFGR2      IC1SEL        LL_LPTIM_SetRemap \n
  *  CFGR2      IC2SEL        LL_LPTIM_SetRemap
  * @param  lptimx Low-Power Timer instance
  * @param  src This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_GPIO
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_COMP1_OUT
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_EVENTOUT
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_MCO1
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_GPIO
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_LSI
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_LSE
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_RCC_HSE_1MHZ
  */
__STATIC_INLINE void LL_LPTIM_SetRemap(LPTIM_TypeDef *lptimx, uint32_t src)
{
  STM32_MODIFY_REG(lptimx->CFGR2, LPTIM_CFGR2_IC1SEL | LPTIM_CFGR2_IC2SEL, src);
}

/**
  * @brief  Get LPTIM input source (default GPIO).
  * @rmtoll
  *  CFGR2      IC1SEL        LL_LPTIM_GetRemap \n
  *  CFGR2      IC2SEL        LL_LPTIM_GetRemap
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_GPIO
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_COMP1_OUT
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_EVENTOUT
  *         @arg @ref LL_LPTIM_LPTIM1_IC1_RMP_MCO1
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_GPIO
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_LSI
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_LSE
  *         @arg @ref LL_LPTIM_LPTIM1_IC2_RMP_RCC_HSE_1MHZ
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetRemap(LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_REG(lptimx->CFGR2) & (LPTIM_CFGR2_IC1SEL | LPTIM_CFGR2_IC2SEL)) ;
}

/**
  * @brief  Set the polarity of IC channel 1.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_IC_SetPolarity \n
  *  CCMR1         CC2P          LL_LPTIM_IC_SetPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_ICPOLARITY_RISING
  *         @arg @ref LL_LPTIM_ICPOLARITY_FALLING
  *         @arg @ref LL_LPTIM_ICPOLARITY_RISING_FALLING
  */
__STATIC_INLINE void LL_LPTIM_IC_SetPolarity(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t polarity)
{
  STM32_MODIFY_REG(lptimx->CCMR1, LPTIM_CCMR1_CC1P << LL_LPTIM_SHIFT_TAB_CCxP[channel], \
                   polarity << LL_LPTIM_SHIFT_TAB_CCxP[channel]);
}

/**
  * @brief  Get the polarity of IC channels.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_IC_GetPolarity \n
  *  CCMR1         CC2P          LL_LPTIM_IC_GetPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_ICPOLARITY_RISING
  *         @arg @ref LL_LPTIM_ICPOLARITY_FALLING
  *         @arg @ref LL_LPTIM_ICPOLARITY_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetPolarity(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  return (uint32_t)((STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_CC1P << LL_LPTIM_SHIFT_TAB_CCxP[channel])) >> \
                    LL_LPTIM_SHIFT_TAB_CCxP[channel]);
}

/**
  * @brief  Configure input channel.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_IC_Config \n
  *  CCMR1         CC2P          LL_LPTIM_IC_Config
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  configuration This parameter must be a combination of all the following values:
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV1 or ... or @ref LL_LPTIM_ICFLT_CLOCK_DIV8
  *         @arg @ref LL_LPTIM_ICPSC_DIV1 or ... or @ref LL_LPTIM_ICPSC_DIV8
  *         @arg @ref LL_LPTIM_OCPOLARITY_HIGH or LL_LPTIM_OCPOLARITY_LOW
  */
__STATIC_INLINE void LL_LPTIM_IC_Config(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t configuration)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&lptimx->CCMR1)));
  STM32_MODIFY_REG(*pReg, \
                   ((LPTIM_CCMR1_CC1SEL \
                     | LPTIM_CCMR1_IC1F  \
                     | LPTIM_CCMR1_CC1P  \
                     | LPTIM_CCMR1_IC1PSC) << LL_LPTIM_SHIFT_TAB_CCxx[channel]), \
                   configuration << LL_LPTIM_SHIFT_TAB_CCxx[channel]);
}

/**
  * @brief  Get the input channel configuration.
  * @rmtoll
  *  CCMR1         CC1P          LL_LPTIM_IC_GetConfig \n
  *  CCMR1         CC2P          LL_LPTIM_IC_GetConfig
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV1 or ... or @ref LL_LPTIM_ICFLT_CLOCK_DIV8
  *         @arg @ref LL_LPTIM_ICPSC_DIV1 or ... or @ref LL_LPTIM_ICPSC_DIV8
  *         @arg @ref LL_LPTIM_OCPOLARITY_HIGH or LL_LPTIM_OCPOLARITY_LOW
  *         @arg @ref LL_LPTIM_CCMODE_INPUTCAPTURE or LL_LPTIM_CCMODE_OUTPUT_PWM
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetConfig(LPTIM_TypeDef *lptimx, uint32_t channel)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&lptimx->CCMR1)));
  uint32_t mask = (LPTIM_CCMR1_CC1SEL   \
                   | LPTIM_CCMR1_IC1F  \
                   | LPTIM_CCMR1_CC1P  \
                   | LPTIM_CCMR1_IC1PSC) << LL_LPTIM_SHIFT_TAB_CCxx[channel];
  uint32_t config = STM32_READ_REG(*pReg) & mask;
  return (config >> LL_LPTIM_SHIFT_TAB_CCxx[channel]);
}

/**
  * @brief  Set the filter of IC channels.
  * @rmtoll
  *  CCMR1         IC1F          LL_LPTIM_IC_SetFilter \n
  *  CCMR1         IC2F          LL_LPTIM_IC_SetFilter
  * @param  lptimx  Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  filter This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV1
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV2
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV4
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV8
  */
__STATIC_INLINE void LL_LPTIM_IC_SetFilter(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t filter)
{
  STM32_MODIFY_REG(lptimx->CCMR1, LPTIM_CCMR1_IC1F << LL_LPTIM_SHIFT_TAB_ICxF[channel],
                   filter << LL_LPTIM_SHIFT_TAB_ICxF[channel]);
}

/**
  * @brief  Get the filter of IC channels.
  * @rmtoll
  *  CCMR1         IC1F          LL_LPTIM_IC_GetFilter \n
  *  CCMR1         IC2F          LL_LPTIM_IC_GetFilter
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV1
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV2
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV4
  *         @arg @ref LL_LPTIM_ICFLT_CLOCK_DIV8
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetFilter(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  return (uint32_t)((STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_IC1F << LL_LPTIM_SHIFT_TAB_ICxF[channel])) >> \
                    LL_LPTIM_SHIFT_TAB_ICxF[channel]);
}

/**
  * @brief  Set the prescaler of IC channels.
  * @rmtoll
  *  CCMR1         IC1PSC        LL_LPTIM_IC_SetPrescaler \n
  *  CCMR1         IC2PSC        LL_LPTIM_IC_SetPrescaler
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_ICPSC_DIV1
  *         @arg @ref LL_LPTIM_ICPSC_DIV2
  *         @arg @ref LL_LPTIM_ICPSC_DIV4
  *         @arg @ref LL_LPTIM_ICPSC_DIV8
  */
__STATIC_INLINE void LL_LPTIM_IC_SetPrescaler(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t prescaler)
{
  STM32_MODIFY_REG(lptimx->CCMR1, LPTIM_CCMR1_IC1PSC << LL_LPTIM_SHIFT_TAB_ICxPSC[channel],
                   prescaler << LL_LPTIM_SHIFT_TAB_ICxPSC[channel]);
}

/**
  * @brief  Get the prescaler of IC channels.
  * @rmtoll
  *  CCMR1         IC1PSC        LL_LPTIM_IC_GetPrescaler \n
  *  CCMR1         IC2PSC        LL_LPTIM_IC_GetPrescaler
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_ICPSC_DIV1
  *         @arg @ref LL_LPTIM_ICPSC_DIV2
  *         @arg @ref LL_LPTIM_ICPSC_DIV4
  *         @arg @ref LL_LPTIM_ICPSC_DIV8
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetPrescaler(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  return (uint32_t)((STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_IC1PSC << LL_LPTIM_SHIFT_TAB_ICxPSC[channel])) >> \
                    LL_LPTIM_SHIFT_TAB_ICxPSC[channel]);
}

/**
  * @brief  Get captured value for the selected capture unit.
  * @rmtoll
  *  CCR1         CCR1          LL_LPTIM_IC_GetCapturedValue \n
  *  CCR2         CCR2          LL_LPTIM_IC_GetCapturedValue
  * @param  lptimx Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCapturedValue(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  const __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&lptimx->CCR1) + \
                                                           LL_LPTIM_SHIFT_TAB_CCRx[channel]));
  return (uint32_t)(STM32_READ_REG(*pReg));
}

/**
  * @brief  Get the LPTIM input capture offset (in counter step units).
  * @rmtoll
  *  CFGR         PRESC          LL_LPTIM_IC_GetOffset \n
  *  CCMR1         IC1F          LL_LPTIM_IC_GetOffset \n
  *  CCMR1         IC2F          LL_LPTIM_IC_GetOffset
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @note   The real capture value corresponding to the input capture trigger can be calculated using
  *         the formula hereafter : Real capture value = captured(LPTIM_CCRx) - offset
  *         The Offset value is depending on the glitch filter value for the channel
  *         and the value of the prescaler for the kernel clock.
  *         Please check Errata Sheet V1_8 for more details under "variable latency
  *         on input capture channel" section.
  * @retval offset value
  */
__STATIC_INLINE uint8_t LL_LPTIM_IC_GetOffset(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  static const uint8_t LL_LPTIM_OFFSET_TAB_ICx[8U][4U] =
  {
    {2U, 7U, 9U, 13U},
    {3U, 5U, 6U, 8U},
    {2U, 3U, 4U, 5U},
    {2U, 2U, 3U, 3U},
    {2U, 2U, 2U, 2U},
    {2U, 2U, 2U, 2U},
    {2U, 2U, 2U, 2U},
    {2U, 2U, 2U, 2U}
  };

