MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
  uint32_t psc = (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_PRESC));;
  uint32_t flt = (uint32_t)((STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_IC1F << LL_LPTIM_SHIFT_TAB_ICxF[channel])) >> \
                            LL_LPTIM_SHIFT_TAB_ICxF[channel]);

  uint8_t offset = LL_LPTIM_OFFSET_TAB_ICx[(psc & LPTIM_CFGR_PRESC_Msk) >> LPTIM_CFGR_PRESC_Pos]\
                   [(flt & LPTIM_CCMR1_IC1F_Msk) >> LPTIM_CCMR1_IC1F_Pos];

  return offset;
}


/**
  * @brief  Set the channel mode.
  * @rmtoll
  *  CCMR1         CC1SEL          LL_LPTIM_CC_SetChannelMode \n
  *  CCMR1         CC2SEL          LL_LPTIM_CC_SetChannelMode
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @param  cc_mode This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CCMODE_OUTPUT_PWM
  *         @arg @ref LL_LPTIM_CCMODE_INPUTCAPTURE
  */
__STATIC_INLINE void  LL_LPTIM_CC_SetChannelMode(LPTIM_TypeDef *lptimx, uint32_t channel, uint32_t cc_mode)
{
  STM32_MODIFY_REG(lptimx->CCMR1, LPTIM_CCMR1_CC1SEL << LL_LPTIM_SHIFT_TAB_CCxSEL[channel],
                   cc_mode << LL_LPTIM_SHIFT_TAB_CCxSEL[channel]);
}

/**
  * @brief  Get the channel mode.
  * @rmtoll
  *  CCMR1         CC1SEL          LL_LPTIM_CC_GetChannelMode \n
  *  CCMR1         CC2SEL          LL_LPTIM_CC_GetChannelMode
  * @param  lptimx Low-Power Timer instance
  * @param  channel This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CHANNEL_CH1
  *         @arg @ref LL_LPTIM_CHANNEL_CH2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_CCMODE_OUTPUT_PWM
  *         @arg @ref LL_LPTIM_CCMODE_INPUTCAPTURE
  */
__STATIC_INLINE uint32_t  LL_LPTIM_CC_GetChannelMode(const LPTIM_TypeDef *lptimx, uint32_t channel)
{
  return (uint32_t)((STM32_READ_BIT(lptimx->CCMR1, LPTIM_CCMR1_CC1SEL << LL_LPTIM_SHIFT_TAB_CCxSEL[channel])) >> \
                    LL_LPTIM_SHIFT_TAB_CCxSEL[channel]);
}

/**
  * @brief  Get captured value for input channel 1.
  * @rmtoll
  *  CCR1         CCR1          LL_LPTIM_IC_GetCaptureCH1
  * @param  lptimx Low-Power Timer instance
  * @note   The real capture value corresponding to the input capture trigger can be calculated using
  *         the formula hereafter : Real capture value = captured(LPTIM_CCRx) - offset
  *         where offset can be retrieved by calling @ref LL_LPTIM_IC_GetOffset
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCaptureCH1(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CCR1, LPTIM_CCR1_CCR1));
}

/**
  * @brief  Get captured value for input channel 2.
  * @rmtoll
  *  CCR2         CCR2          LL_LPTIM_IC_GetCaptureCH2
  * @param  lptimx Low-Power Timer instance
  * @note   The real capture value corresponding to the input capture trigger can be calculated using
  *         the formula hereafter : Real capture value = captured(LPTIM_CCRx) - offset
  *         where offset can be retrieved by calling @ref LL_LPTIM_IC_GetOffset
  * @retval CapturedValue (between Min_Data=0 and Max_Data=65535)
  */
__STATIC_INLINE uint32_t LL_LPTIM_IC_GetCaptureCH2(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CCR2, LPTIM_CCR2_CCR2));
}

/**
  * @}
  */
/** @defgroup LPTIM_LL_EF_Trigger_Configuration Trigger Configuration
  * @{
  */

/**
  * @brief  Enable the timeout function.
  * @rmtoll
  *  CFGR         TIMOUT        LL_LPTIM_EnableTimeout
  * @param  lptimx Low-Power Timer instance
  * @note This function must be called when the LPTIM instance is disabled.
  * @note The first trigger event will start the timer, any successive trigger
  *       event will reset the counter and the timer will restart.
  * @note The timeout value corresponds to the compare value; if no trigger
  *       occurs within the expected time frame, the MCU is waked-up by the
  *       compare match event.
  */
__STATIC_INLINE void LL_LPTIM_EnableTimeout(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->CFGR, LPTIM_CFGR_TIMOUT);
}

/**
  * @brief  Disable the timeout function.
  * @rmtoll
  *  CFGR         TIMOUT        LL_LPTIM_DisableTimeout
  * @param  lptimx Low-Power Timer instance
  * @note This function must be called when the LPTIM instance is disabled.
  * @note A trigger event arriving when the timer is already started will be
  *       ignored.
  */
__STATIC_INLINE void LL_LPTIM_DisableTimeout(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->CFGR, LPTIM_CFGR_TIMOUT);
}

/**
  * @brief  Indicate whether the timeout function is enabled.
  * @rmtoll
  *  CFGR         TIMOUT        LL_LPTIM_IsEnabledTimeout
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledTimeout(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_TIMOUT) == LPTIM_CFGR_TIMOUT) ? 1UL : 0UL));
}

/**
  * @brief  Start the LPTIM counter.
  * @rmtoll
  *  CFGR         TRIGEN        LL_LPTIM_TrigSw
  * @param  lptimx Low-Power Timer instance
  * @note This function must be called when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_TrigSw(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->CFGR, LPTIM_CFGR_TRIGEN);
}

/**
  * @brief  Configure the external trigger used as a trigger event for the LPTIM.
  * @rmtoll
  *  CFGR         TRIGSEL       LL_LPTIM_ConfigTrigger \n
  *  CFGR         TRGFLT        LL_LPTIM_ConfigTrigger \n
  *  CFGR         TRIGEN        LL_LPTIM_ConfigTrigger
  * @param  lptimx    Low-Power Timer instance
  * @param  source    This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_GPIO
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRA_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRB_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG1
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG2
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_LPDMA_CH1_TC
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_COMP1_OUT
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_EVENTOUT
  * @param  filter    This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_FILTER_NONE
  *         @arg @ref LL_LPTIM_TRIG_FILTER_2
  *         @arg @ref LL_LPTIM_TRIG_FILTER_4
  *         @arg @ref LL_LPTIM_TRIG_FILTER_8
  * @param  polarity  This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING_FALLING
  * @note This function must be called when the LPTIM instance is disabled.
  * @note An internal clock source must be present when a digital filter is
  *       required for the trigger.
  */
__STATIC_INLINE void LL_LPTIM_ConfigTrigger(LPTIM_TypeDef *lptimx, uint32_t source, uint32_t filter, uint32_t polarity)
{
  STM32_MODIFY_REG(lptimx->CFGR, \
                   LPTIM_CFGR_TRIGSEL | LPTIM_CFGR_TRGFLT | LPTIM_CFGR_TRIGEN, \
                   source | filter | polarity);
}


/**
  * @brief  Set external trigger source.
  * @rmtoll
  *  CFGR         TRIGSEL       LL_LPTIM_SetTriggerSource
  * @param  lptimx Low-Power Timer instance
  * @param  source Trigger's source.
  *         Can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_GPIO
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRA_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRB_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG1
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG2
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_LPDMA_CH1_TC
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_COMP1_OUT
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_EVENTOUT
  */
__STATIC_INLINE void LL_LPTIM_SetTriggerSource(LPTIM_TypeDef *lptimx, uint32_t source)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_TRIGSEL, source);
}

/**
  * @brief  Get actual external trigger source.
  * @rmtoll
  *  CFGR         TRIGSEL       LL_LPTIM_GetTriggerSource
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_GPIO
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRA_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_RTC_ALRB_TRG
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG1
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_TAMP_TRG2
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_LPDMA_CH1_TC
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_COMP1_OUT
  *         @arg @ref LL_LPTIM_TRIG_SOURCE_EVENTOUT
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetTriggerSource(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_TRIGSEL));
}

/**
  * @brief  Set external trigger filter.
  * @rmtoll
  *  CFGR         TRGFLT        LL_LPTIM_GetTriggerFilter
  * @param  lptimx Low-Power Timer instance
  * @param  filter ETR filter.
  *         Can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_FILTER_NONE
  *         @arg @ref LL_LPTIM_TRIG_FILTER_2
  *         @arg @ref LL_LPTIM_TRIG_FILTER_4
  *         @arg @ref LL_LPTIM_TRIG_FILTER_8
  */
__STATIC_INLINE void LL_LPTIM_SetTriggerFilter(LPTIM_TypeDef *lptimx, uint32_t filter)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_TRGFLT, filter);
}

/**
  * @brief  Get actual external trigger filter.
  * @rmtoll
  *  CFGR         TRGFLT        LL_LPTIM_GetTriggerFilter
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_FILTER_NONE
  *         @arg @ref LL_LPTIM_TRIG_FILTER_2
  *         @arg @ref LL_LPTIM_TRIG_FILTER_4
  *         @arg @ref LL_LPTIM_TRIG_FILTER_8
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetTriggerFilter(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_TRGFLT));
}

/**
  * @brief  Set external trigger polarity.
  * @rmtoll
  *  CFGR         TRIGEN        LL_LPTIM_GetTriggerPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  polarity Trigger's polarity.
  *         Can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING_FALLING
  */
__STATIC_INLINE void LL_LPTIM_SetTriggerPolarity(LPTIM_TypeDef *lptimx, uint32_t polarity)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_TRIGEN, polarity);
}

/**
  * @brief  Get actual external trigger polarity.
  * @rmtoll
  *  CFGR         TRIGEN        LL_LPTIM_GetTriggerPolarity
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_TRIG_POLARITY_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetTriggerPolarity(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_TRIGEN));
}

/**
  * @}
  */

