MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/** @defgroup LPTIM_LL_EF_Clock_Configuration Clock Configuration
  * @{
  */

/**
  * @brief  Set the source of the clock used by the LPTIM instance.
  * @rmtoll
  *  CFGR         CKSEL         LL_LPTIM_SetClockSource
  * @param  lptimx       Low-Power Timer instance
  * @param  clock_source This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_SOURCE_INTERNAL
  *         @arg @ref LL_LPTIM_CLK_SOURCE_EXTERNAL
  * @note This function must be called when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_SetClockSource(LPTIM_TypeDef *lptimx, uint32_t clock_source)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_CKSEL, clock_source);
}

/**
  * @brief  Get actual LPTIM instance clock source.
  * @rmtoll
  *  CFGR         CKSEL         LL_LPTIM_GetClockSource
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_SOURCE_INTERNAL
  *         @arg @ref LL_LPTIM_CLK_SOURCE_EXTERNAL
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetClockSource(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_CKSEL));
}

/**
  * @brief  Configure the active edge or edges used by the counter when
            the LPTIM is clocked by an external clock source.
  * @rmtoll
  *  CFGR         CKFLT         LL_LPTIM_ConfigClock \n
  *  CFGR         CKPOL         LL_LPTIM_ConfigClock
  * @param  lptimx         Low-Power Timer instance
  * @param  clock_filter   This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_FILTER_NONE
  *         @arg @ref LL_LPTIM_CLK_FILTER_2
  *         @arg @ref LL_LPTIM_CLK_FILTER_4
  *         @arg @ref LL_LPTIM_CLK_FILTER_8
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING_FALLING
  * @note This function must be called when the LPTIM instance is disabled.
  * @note When both external clock signal edges are considered active ones,
  *       the LPTIM must also be clocked by an internal clock source with a
  *       frequency equal to at least four times the external clock frequency.
  * @note An internal clock source must be present when a digital filter is
  *       required for external clock.
  */
__STATIC_INLINE void LL_LPTIM_ConfigClock(LPTIM_TypeDef *lptimx, uint32_t clock_filter, uint32_t clock_polarity)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_CKFLT | LPTIM_CFGR_CKPOL, clock_filter | clock_polarity);
}

/**
  * @brief  Set clock polarity.
  * @rmtoll
  *  CFGR         CKPOL         LL_LPTIM_SetClockPolarity
  * @param  lptimx Low-Power Timer instance
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING_FALLING
  */
__STATIC_INLINE void LL_LPTIM_SetClockPolarity(LPTIM_TypeDef *lptimx, uint32_t clock_polarity)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_CKPOL, clock_polarity);
}

/**
  * @brief  Get actual clock polarity.
  * @rmtoll
  *  CFGR         CKPOL         LL_LPTIM_GetClockPolarity
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_FALLING
  *         @arg @ref LL_LPTIM_CLK_POLARITY_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetClockPolarity(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_CKPOL));
}

/**
  * @brief  Set clock filter.
  * @rmtoll
  *  CFGR         CKFLT         LL_LPTIM_SetClockFilter
  * @param  lptimx Low-Power Timer instance
  * @param  clock_filter This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_FILTER_NONE
  *         @arg @ref LL_LPTIM_CLK_FILTER_2
  *         @arg @ref LL_LPTIM_CLK_FILTER_4
  *         @arg @ref LL_LPTIM_CLK_FILTER_8
  */
__STATIC_INLINE void LL_LPTIM_SetClockFilter(LPTIM_TypeDef *lptimx, uint32_t clock_filter)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_CKFLT, clock_filter);
}

/**
  * @brief  Get actual clock digital filter.
  * @rmtoll
  *  CFGR         CKFLT         LL_LPTIM_GetClockFilter
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_CLK_FILTER_NONE
  *         @arg @ref LL_LPTIM_CLK_FILTER_2
  *         @arg @ref LL_LPTIM_CLK_FILTER_4
  *         @arg @ref LL_LPTIM_CLK_FILTER_8
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetClockFilter(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_CKFLT));
}

/**
  * @}
  */

/** @defgroup LPTIM_LL_EF_Encoder_Mode Encoder Mode
  * @{
  */

/**
  * @brief  Configure the encoder mode.
  * @rmtoll
  *  CFGR         CKPOL         LL_LPTIM_SetEncoderMode
  * @param  lptimx Low-Power Timer instance
  * @param  encoder_mode This parameter can be one of the following values:
  *         @arg @ref LL_LPTIM_ENCODER_MODE_RISING
  *         @arg @ref LL_LPTIM_ENCODER_MODE_FALLING
  *         @arg @ref LL_LPTIM_ENCODER_MODE_RISING_FALLING
  * @note This function must be called when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_SetEncoderMode(LPTIM_TypeDef *lptimx, uint32_t encoder_mode)
{
  STM32_MODIFY_REG(lptimx->CFGR, LPTIM_CFGR_CKPOL, encoder_mode);
}

/**
  * @brief  Get actual encoder mode.
  * @rmtoll
  *  CFGR         CKPOL         LL_LPTIM_GetEncoderMode
  * @param  lptimx Low-Power Timer instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPTIM_ENCODER_MODE_RISING
  *         @arg @ref LL_LPTIM_ENCODER_MODE_FALLING
  *         @arg @ref LL_LPTIM_ENCODER_MODE_RISING_FALLING
  */
__STATIC_INLINE uint32_t LL_LPTIM_GetEncoderMode(const LPTIM_TypeDef *lptimx)
{
  return (uint32_t)(STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_CKPOL));
}

/**
  * @brief  Enable the encoder mode.
  * @rmtoll
  *  CFGR         ENC           LL_LPTIM_EnableEncoderMode
  * @param  lptimx Low-Power Timer instance
  * @note This function must be called when the LPTIM instance is disabled.
  * @note In this mode the LPTIM instance must be clocked by an internal clock
  *       source. Also, the prescaler division ratio must be equal to 1.
  * @note LPTIM instance must be configured in continuous mode prior enabling
  *       the encoder mode.
  */
__STATIC_INLINE void LL_LPTIM_EnableEncoderMode(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->CFGR, LPTIM_CFGR_ENC);
}

/**
  * @brief  Disable the encoder mode.
  * @rmtoll
  *  CFGR         ENC           LL_LPTIM_DisableEncoderMode
  * @param  lptimx Low-Power Timer instance
  * @note This function must be called when the LPTIM instance is disabled.
  */
__STATIC_INLINE void LL_LPTIM_DisableEncoderMode(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->CFGR, LPTIM_CFGR_ENC);
}

/**
  * @brief  Indicates whether the LPTIM operates in encoder mode.
  * @rmtoll
  *  CFGR         ENC           LL_LPTIM_IsEnabledEncoderMode
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledEncoderMode(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->CFGR, LPTIM_CFGR_ENC) == LPTIM_CFGR_ENC) ? 1UL : 0UL));
}

/**
  * @}
  */

/** @defgroup LPTIM_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear the compare match flag for channel 1 (CC1CF).
  * @rmtoll
  *  ICR          CC1CF        LL_LPTIM_ClearFlag_CC1
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CC1(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CC1CF);
}

/**
  * @brief  Inform application whether a capture/compare interrupt has occurred for channel 1.
  * @rmtoll
  *  ISR          CC1IF         LL_LPTIM_IsActiveFlag_CC1
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CC1(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CC1IF) == LPTIM_ISR_CC1IF) ? 1UL : 0UL));
}

/**
  * @brief  Clear the compare match flag for channel 2 (CC2CF).
  * @rmtoll
  *  ICR          CC2CF        LL_LPTIM_ClearFlag_CC2
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CC2(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CC2CF);
}

/**
  * @brief  Inform application whether a capture/compare interrupt has occurred for channel 2.
  * @rmtoll
  *  ISR          CC2IF          LL_LPTIM_IsActiveFlag_CC2
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CC2(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CC2IF) == LPTIM_ISR_CC2IF) ? 1UL : 0UL));
}

/**
  * @brief  Clear the Capture/Compare 1 over-capture flag for channel 1 (CC1OCF).
  * @rmtoll
  *  ICR          CC1OCF       LL_LPTIM_ClearFlag_CC1O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CC1O(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CC1OCF);
}

/**
  * @brief  Inform application whether a Capture/Compare 1 over-capture  has occurred for channel 1.
  * @rmtoll
  *  ISR          CC1OF          LL_LPTIM_IsActiveFlag_CC1O
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CC1O(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CC1OF) == LPTIM_ISR_CC1OF) ? 1UL : 0UL));
}

/**
  * @brief  Clear the Capture/Compare 2 over-capture flag for channel 2 (CC2OCF).
  * @rmtoll
  *  ICR          CC2OCF       LL_LPTIM_ClearFlag_CC2O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CC2O(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CC2OCF);
}

/**
  * @brief  Inform application whether a Capture/Compare 2 over-capture  has occurred for channel 2.
  * @rmtoll
  *  ISR          CC2OF          LL_LPTIM_IsActiveFlag_CC2O
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CC2O(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CC2OF) == LPTIM_ISR_CC2OF) ? 1UL : 0UL));
}

/**
  * @brief  Clear the autoreload match flag (ARRMCF).
  * @rmtoll
  *  ICR          ARRMCF        LL_LPTIM_ClearFlag_ARRM
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_ARRM(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_ARRMCF);
}

/**
  * @brief  Inform application whether a autoreload match interrupt has occurred.
  * @rmtoll
  *  ISR          ARRM          LL_LPTIM_IsActiveFlag_ARRM
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_ARRM(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_ARRM) == LPTIM_ISR_ARRM) ? 1UL : 0UL));
}

/**
  * @brief  Clear the external trigger valid edge flag(EXTTRIGCF).
  * @rmtoll
  *  ICR          EXTTRIGCF     LL_LPTIM_ClearFlag_EXTTRIG
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_EXTTRIG(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_EXTTRIGCF);
}

/**
  * @brief  Inform application whether a valid edge on the selected external trigger input has occurred.
  * @rmtoll
  *  ISR          EXTTRIG       LL_LPTIM_IsActiveFlag_EXTTRIG
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_EXTTRIG(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_EXTTRIG) == LPTIM_ISR_EXTTRIG) ? 1UL : 0UL));
}

/**
  * @brief  Clear the compare register update interrupt flag (CMP1OKCF).
  * @rmtoll
  *  ICR          CMP1OKCF       LL_LPTIM_ClearFlag_CMP1OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CMP1OK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CMP1OKCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_CCR1 register has been successfully
            completed. If so, a new one can be initiated.
  * @rmtoll
  *  ISR          CMP1OK         LL_LPTIM_IsActiveFlag_CMP1OK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CMP1OK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CMP1OK) == LPTIM_ISR_CMP1OK) ? 1UL : 0UL));
}

/**
  * @brief  Clear the compare register update interrupt flag (CMP2OKCF).
  * @rmtoll
  *  ICR          CMP2OKCF       LL_LPTIM_ClearFlag_CMP2OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_CMP2OK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_CMP2OKCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_CCR2 register has been successfully
            completed. If so, a new one can be initiated.
  * @rmtoll
  *  ISR          CMP2OK         LL_LPTIM_IsActiveFlag_CMP2OK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_CMP2OK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_CMP2OK) == LPTIM_ISR_CMP2OK) ? 1UL : 0UL));
}

/**
  * @brief  Clear the interrupt register update interrupt flag (DIEROKCF).
  * @rmtoll
  *  ICR       DIEROKCF          LL_LPTIM_ClearFlag_DIEROK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_DIEROK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_DIEROKCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_DIER register has been successfully
            completed. If so, a new one can be initiated.
  * @rmtoll
  *  ISR          DIEROK            LL_LPTIM_IsActiveFlag_DIEROK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_DIEROK(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_DIEROK) == (LPTIM_ISR_DIEROK)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the autoreload register update interrupt flag (ARROKCF).
  * @rmtoll
  *  ICR          ARROKCF       LL_LPTIM_ClearFlag_ARROK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_ARROK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_ARROKCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_ARR register has been successfully
            completed. If so, a new one can be initiated.
  * @rmtoll
  *  ISR          ARROK         LL_LPTIM_IsActiveFlag_ARROK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_ARROK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_ARROK) == LPTIM_ISR_ARROK) ? 1UL : 0UL));
}

/**
  * @brief  Clear the counter direction change to up interrupt flag (UPCF).
  * @rmtoll
  *  ICR          UPCF          LL_LPTIM_ClearFlag_UP
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_UP(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_UPCF);
}

/**
  * @brief  Informs the application whether the counter direction has changed from down to up (when the LPTIM instance
            operates in encoder mode).
  * @rmtoll
  *  ISR          UP            LL_LPTIM_IsActiveFlag_UP
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_UP(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_UP) == LPTIM_ISR_UP) ? 1UL : 0UL));
}

/**
  * @brief  Clear the counter direction change to down interrupt flag (DOWNCF).
  * @rmtoll
  *  ICR          DOWNCF        LL_LPTIM_ClearFlag_DOWN
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_DOWN(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_DOWNCF);
}

/**
  * @brief  Informs the application whether the counter direction has changed from up to down (when the LPTIM instance
            operates in encoder mode).
  * @rmtoll
  *  ISR          DOWN          LL_LPTIM_IsActiveFlag_DOWN
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_DOWN(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_DOWN) == LPTIM_ISR_DOWN) ? 1UL : 0UL));
}

/**
  * @brief  Clear the repetition register update interrupt flag (REPOKCF).
  * @rmtoll
  *  ICR          REPOKCF       LL_LPTIM_ClearFlag_REPOK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_REPOK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_REPOKCF);
}

/**
  * @brief  Informs application whether the APB bus write operation to the LPTIMx_RCR register has been successfully
            completed; If so, a new one can be initiated.
  * @rmtoll
  *  ISR          REPOK         LL_LPTIM_IsActiveFlag_REPOK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_REPOK(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_REPOK) == (LPTIM_ISR_REPOK)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the update event flag (UECF).
  * @rmtoll
  *  ICR          UECF          LL_LPTIM_ClearFlag_UE
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_ClearFlag_UE(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->ICR, LPTIM_ICR_UECF);
}

/**
  * @brief  Indicate whether the LPTIM update event has occurred.
  * @rmtoll
  *  ISR          UE            LL_LPTIM_IsActiveFlag_UE
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsActiveFlag_UE(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->ISR, LPTIM_ISR_UE) == (LPTIM_ISR_UE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LPTIM_LL_EF_IT_Management Interrupt Management
  * @{
  */

/**
  * @brief  Enable interrupt.
  * @rmtoll
  *  DIER         CC1IE        LL_LPTIM_EnableIT \n
  *  DIER         CC2IE        LL_LPTIM_EnableIT \n
  *  DIER         CC1OIE       LL_LPTIM_EnableIT \n
  *  DIER         CC2OIE       LL_LPTIM_EnableIT \n
  *  DIER         ARRMIE       LL_LPTIM_EnableIT \n
  *  DIER         EXTTRIGIE    LL_LPTIM_EnableIT \n
  *  DIER         CMP1OKIE     LL_LPTIM_EnableIT \n
  *  DIER         CMP2OKIE     LL_LPTIM_EnableIT \n
  *  DIER         ARROKIE      LL_LPTIM_EnableIT \n
  *  DIER         UPIE         LL_LPTIM_EnableIT \n
  *  DIER         DOWNIE       LL_LPTIM_EnableIT \n
  *  DIER         REPOKIE      LL_LPTIM_EnableIT \n
  *  DIER         UEIE         LL_LPTIM_EnableIT
  * @param  lptimx Low-Power Timer instance
  * @param  it_mask specifies the interrupt source(s) to enable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_CMP1OKIE
  *         @arg @ref LL_LPTIM_DIER_CMP2OKIE
  *         @arg @ref LL_LPTIM_DIER_CC1IE
  *         @arg @ref LL_LPTIM_DIER_CC2IE
  *         @arg @ref LL_LPTIM_DIER_ARRMIE
  *         @arg @ref LL_LPTIM_DIER_EXTTRIGIE
  *         @arg @ref LL_LPTIM_DIER_ARROKIE
  *         @arg @ref LL_LPTIM_DIER_UPIE
  *         @arg @ref LL_LPTIM_DIER_DOWNIE
  *         @arg @ref LL_LPTIM_DIER_UEIE
  *         @arg @ref LL_LPTIM_DIER_REPOKIE
  */
__STATIC_INLINE void LL_LPTIM_EnableIT(LPTIM_TypeDef *lptimx, uint32_t it_mask)
{
  STM32_SET_BIT(lptimx->DIER, it_mask);
}

/**
  * @brief  Disable interrupt.
  * @rmtoll
  *  DIER         CC1IE        LL_LPTIM_DisableIT \n
  *  DIER         CC2IE        LL_LPTIM_DisableIT \n
  *  DIER         CC1OIE       LL_LPTIM_DisableIT \n
  *  DIER         CC2OIE       LL_LPTIM_DisableIT \n
  *  DIER         ARRMIE       LL_LPTIM_DisableIT \n
  *  DIER         EXTTRIGIE    LL_LPTIM_DisableIT \n
  *  DIER         CMP1OKIE     LL_LPTIM_DisableIT \n
  *  DIER         CMP2OKIE     LL_LPTIM_DisableIT \n
  *  DIER         ARROKIE      LL_LPTIM_DisableIT \n
  *  DIER         UPIE         LL_LPTIM_DisableIT \n
  *  DIER         DOWNIE       LL_LPTIM_DisableIT \n
  *  DIER         REPOKIE      LL_LPTIM_DisableIT \n
  *  DIER         UEIE         LL_LPTIM_DisableIT
  * @param  lptimx Low-Power Timer instance
  * @param  it_mask specifies the interrupt source(s) to disable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_CMP1OKIE
  *         @arg @ref LL_LPTIM_DIER_CMP2OKIE
  *         @arg @ref LL_LPTIM_DIER_CC1IE
  *         @arg @ref LL_LPTIM_DIER_CC2IE
  *         @arg @ref LL_LPTIM_DIER_ARRMIE
  *         @arg @ref LL_LPTIM_DIER_EXTTRIGIE
  *         @arg @ref LL_LPTIM_DIER_ARROKIE
  *         @arg @ref LL_LPTIM_DIER_UPIE
  *         @arg @ref LL_LPTIM_DIER_DOWNIE
  *         @arg @ref LL_LPTIM_DIER_UEIE
  *         @arg @ref LL_LPTIM_DIER_REPOKIE
  */
__STATIC_INLINE void LL_LPTIM_DisableIT(LPTIM_TypeDef *lptimx, uint32_t it_mask)
{
  STM32_CLEAR_BIT(lptimx->DIER, it_mask);
}

/**
  * @brief  Indicates whether the interrupt(s) are enabled.
  * @rmtoll
  *  DIER         CC1IE        LL_LPTIM_IsEnabledIT \n
  *  DIER         CC2IE        LL_LPTIM_IsEnabledIT \n
  *  DIER         CC1OIE       LL_LPTIM_IsEnabledIT \n
  *  DIER         CC2OIE       LL_LPTIM_IsEnabledIT \n
  *  DIER         ARRMIE       LL_LPTIM_IsEnabledIT \n
  *  DIER         EXTTRIGIE    LL_LPTIM_IsEnabledIT \n
  *  DIER         CMP1OKIE     LL_LPTIM_IsEnabledIT \n
  *  DIER         CMP2OKIE     LL_LPTIM_IsEnabledIT \n
  *  DIER         ARROKIE      LL_LPTIM_IsEnabledIT \n
  *  DIER         UPIE         LL_LPTIM_IsEnabledIT \n
  *  DIER         DOWNIE       LL_LPTIM_IsEnabledIT \n
  *  DIER         REPOKIE      LL_LPTIM_IsEnabledIT \n
  *  DIER         UEIE         LL_LPTIM_IsEnabledIT
  * @param  lptimx Low-Power Timer instance
  * @param  it_mask specifies the interrupt source(s) to check.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_CMP1OKIE
  *         @arg @ref LL_LPTIM_DIER_CMP2OKIE
  *         @arg @ref LL_LPTIM_DIER_CC1IE
  *         @arg @ref LL_LPTIM_DIER_CC2IE
  *         @arg @ref LL_LPTIM_DIER_ARRMIE
  *         @arg @ref LL_LPTIM_DIER_EXTTRIGIE
  *         @arg @ref LL_LPTIM_DIER_ARROKIE
  *         @arg @ref LL_LPTIM_DIER_UPIE
  *         @arg @ref LL_LPTIM_DIER_DOWNIE
  *         @arg @ref LL_LPTIM_DIER_UEIE
  *         @arg @ref LL_LPTIM_DIER_REPOKIE
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT(LPTIM_TypeDef *lptimx, uint32_t it_mask)
{
  return ((((STM32_READ_REG(lptimx->DIER) & it_mask) == it_mask) ? 1UL : 0UL));
}

/**
  * @brief  Enable capture/compare 1 interrupt (CC1IE).
  * @rmtoll
  *  DIER         CC1IE        LL_LPTIM_EnableIT_CC1
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CC1(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC1IE);
}

/**
  * @brief  Disable capture/compare 1 interrupt (CC1IE).
  * @rmtoll
  *  DIER          CC1IE        LL_LPTIM_DisableIT_CC1
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CC1(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC1IE);
}

