MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/**
  * @brief  Indicates whether the capture/compare 1 interrupt (CC1IE) is enabled.
  * @rmtoll
  *  DIER          CC1IE        LL_LPTIM_IsEnabledIT_CC1
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CC1(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC1IE) == LPTIM_DIER_CC1IE) ? 1UL : 0UL));
}

/**
  * @brief  Enable capture/compare 1 interrupt (CC2IE).
  * @rmtoll
  *  DIER         CC2IE        LL_LPTIM_EnableIT_CC2
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CC2(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC2IE);
}

/**
  * @brief  Disable capture/compare 2 interrupt (CC2IE).
  * @rmtoll
  *  DIER          CC2IE        LL_LPTIM_DisableIT_CC2
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CC2(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC2IE);
}

/**
  * @brief  Indicates whether the capture/compare 2 interrupt (CC2IE) is enabled.
  * @rmtoll
  *  DIER          CC2IE        LL_LPTIM_IsEnabledIT_CC2
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CC2(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC2IE) == LPTIM_DIER_CC2IE) ? 1UL : 0UL));
}

/**
  * @brief  Enable capture/compare 1 over-capture interrupt (CC1OIE).
  * @rmtoll
  *  DIER         CC1OIE        LL_LPTIM_EnableIT_CC1O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CC1O(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC1OIE);
}

/**
  * @brief  Disable capture/compare 1 over-capture interrupt (CC1OIE).
  * @rmtoll
  *  DIER          CC1OIE        LL_LPTIM_DisableIT_CC1O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CC1O(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC1OIE);
}

/**
  * @brief  Indicates whether the capture/compare 1 over-capture interrupt (CC1OIE) is enabled.
  * @rmtoll
  *  DIER          CC1OIE        LL_LPTIM_IsEnabledIT_CC1O
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CC1O(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC1OIE) == LPTIM_DIER_CC1OIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable capture/compare 1 over-capture interrupt (CC2OIE).
  * @rmtoll
  *  DIER         CC2OIE        LL_LPTIM_EnableIT_CC2O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CC2O(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC2OIE);
}

/**
  * @brief  Disable capture/compare 1 over-capture interrupt (CC2OIE).
  * @rmtoll
  *  DIER          CC2OIE        LL_LPTIM_DisableIT_CC2O
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CC2O(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC2OIE);
}

/**
  * @brief  Indicates whether the capture/compare 2 over-capture interrupt (CC2OIE) is enabled.
  * @rmtoll
  *  DIER          CC2OIE        LL_LPTIM_IsEnabledIT_CC2O
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CC2O(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC2OIE) == LPTIM_DIER_CC2OIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable autoreload match interrupt (ARRMIE).
  * @rmtoll
  *  DIER          ARRMIE        LL_LPTIM_EnableIT_ARRM
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_ARRM(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_ARRMIE);
}

/**
  * @brief  Disable autoreload match interrupt (ARRMIE).
  * @rmtoll
  *  DIER          ARRMIE        LL_LPTIM_DisableIT_ARRM
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_ARRM(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_ARRMIE);
}

/**
  * @brief  Indicates whether the autoreload match interrupt (ARRMIE) is enabled.
  * @rmtoll
  *  DIER          ARRMIE        LL_LPTIM_IsEnabledIT_ARRM
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_ARRM(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_ARRMIE) == LPTIM_DIER_ARRMIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable external trigger valid edge interrupt (EXTTRIGIE).
  * @rmtoll
  *  DIER          EXTTRIGIE     LL_LPTIM_EnableIT_EXTTRIG
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_EXTTRIG(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_EXTTRIGIE);
}

/**
  * @brief  Disable external trigger valid edge interrupt (EXTTRIGIE).
  * @rmtoll
  *  DIER          EXTTRIGIE     LL_LPTIM_DisableIT_EXTTRIG
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_EXTTRIG(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_EXTTRIGIE);
}

/**
  * @brief  Indicates external trigger valid edge interrupt (EXTTRIGIE) is enabled.
  * @rmtoll
  *  DIER          EXTTRIGIE     LL_LPTIM_IsEnabledIT_EXTTRIG
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_EXTTRIG(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_EXTTRIGIE) == LPTIM_DIER_EXTTRIGIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable compare register write completed interrupt (CMP1OKIE).
  * @rmtoll
  *  IER          CMP1OKIE       LL_LPTIM_EnableIT_CMP1OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CMP1OK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CMP1OKIE);
}

/**
  * @brief  Disable compare register write completed interrupt (CMP1OKIE).
  * @rmtoll
  *  IER          CMPO1KIE       LL_LPTIM_DisableIT_CMP1OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CMP1OK(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CMP1OKIE);
}

/**
  * @brief  Indicates whether the compare register write completed interrupt (CMP1OKIE) is enabled.
  * @rmtoll
  *  IER          CMP1OKIE       LL_LPTIM_IsEnabledIT_CMP1OK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CMP1OK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CMP1OKIE) == LPTIM_DIER_CMP1OKIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable compare register write completed interrupt (CMP2OKIE).
  * @rmtoll
  *  IER          CMP2OKIE       LL_LPTIM_EnableIT_CMP2OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_CMP2OK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CMP2OKIE);
}

/**
  * @brief  Disable compare register write completed interrupt (CMP2OKIE).
  * @rmtoll
  *  IER          CMP2OKIE       LL_LPTIM_DisableIT_CMP2OK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_CMP2OK(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CMP2OKIE);
}

/**
  * @brief  Indicates whether the compare register write completed interrupt (CMP2OKIE) is enabled.
  * @rmtoll
  *  IER          CMP2OKIE       LL_LPTIM_IsEnabledIT_CMP2OK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_CMP2OK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CMP2OKIE) == LPTIM_DIER_CMP2OKIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable autoreload register write completed interrupt (ARROKIE).
  * @rmtoll
  *  DIER         ARROKIE       LL_LPTIM_EnableIT_ARROK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_ARROK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_ARROKIE);
}

/**
  * @brief  Disable autoreload register write completed interrupt (ARROKIE).
  * @rmtoll
  *  DIER         ARROKIE       LL_LPTIM_DisableIT_ARROK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_ARROK(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_ARROKIE);
}

/**
  * @brief  Indicates whether the autoreload register write completed interrupt (ARROKIE) is enabled.
  * @rmtoll
  *  DIER         ARROKIE       LL_LPTIM_IsEnabledIT_ARROK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit(1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_ARROK(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_ARROKIE) == LPTIM_DIER_ARROKIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable direction change to up interrupt (UPIE).
  * @rmtoll
  *  DIER         UPIE          LL_LPTIM_EnableIT_UP
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_UP(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_UPIE);
}

/**
  * @brief  Disable direction change to up interrupt (UPIE).
  * @rmtoll
  *  DIER         UPIE          LL_LPTIM_DisableIT_UP
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_UP(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_UPIE);
}

/**
  * @brief  Indicates whether the direction change to up interrupt (UPIE) is enabled.
  * @rmtoll
  *  DIER         UPIE          LL_LPTIM_IsEnabledIT_UP
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit(1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_UP(const LPTIM_TypeDef *lptimx)
{
  return (((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_UPIE) == LPTIM_DIER_UPIE) ? 1UL : 0UL));
}

/**
  * @brief  Enable direction change to down interrupt (DOWNIE).
  * @rmtoll
  *  DIER         DOWNIE        LL_LPTIM_EnableIT_DOWN
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_DOWN(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_DOWNIE);
}

/**
  * @brief  Disable direction change to down interrupt (DOWNIE).
  * @rmtoll
  *  DIER         DOWNIE        LL_LPTIM_DisableIT_DOWN
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_DOWN(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_DOWNIE);
}

/**
  * @brief  Indicates whether the direction change to down interrupt (DOWNIE) is enabled.
  * @rmtoll
  *  DIER         DOWNIE        LL_LPTIM_IsEnabledIT_DOWN
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit(1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_DOWN(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_DOWNIE) == LPTIM_DIER_DOWNIE) ? 1UL : 0UL);
}

/**
  * @brief  Enable repetition register update successfully completed interrupt (REPOKIE).
  * @rmtoll
  *  DIER         REPOKIE       LL_LPTIM_EnableIT_REPOK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_REPOK(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_REPOKIE);
}

/**
  * @brief  Disable repetition register update successfully completed interrupt (REPOKIE).
  * @rmtoll
  *  DIER         REPOKIE       LL_LPTIM_DisableIT_REPOK
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_REPOK(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_REPOKIE);
}

/**
  * @brief  Indicates whether the repetition register update successfully completed interrupt (REPOKIE) is enabled.
  * @rmtoll
  *  DIER         REPOKIE       LL_LPTIM_IsEnabledIT_REPOK
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit(1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_REPOK(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_REPOKIE) == (LPTIM_DIER_REPOKIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable update event interrupt (UEIE).
  * @rmtoll
  *  DIER         UEIE          LL_LPTIM_EnableIT_UE
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableIT_UE(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_UEIE);
}

/**
  * @brief  Disable update event interrupt (UEIE).
  * @rmtoll
  *  DIER          UEIE         LL_LPTIM_DisableIT_UE
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableIT_UE(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_UEIE);
}

/**
  * @brief  Indicates whether the update event interrupt (UEIE) is enabled.
  * @rmtoll
  *  DIER         UEIE          LL_LPTIM_IsEnabledIT_UE
  * @param  lptimx Low-Power Timer instance
  *@ retval State of bit(1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledIT_UE(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_UEIE) == (LPTIM_DIER_UEIE)) ? 1UL : 0UL);
}
/**
  * @}
  */

