MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lptim.h
/** @defgroup LPTIM_LL_EF_DMA_Management DMA Management
  * @{
  */

/**
  * @brief  Enable the selected DMA request(s).
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_EnableDMAReq \n
  *  DIER         CC1DE         LL_LPTIM_EnableDMAReq \n
  *  DIER         CC2DE         LL_LPTIM_EnableDMAReq
  * @param  lptimx Low-Power Timer instance
  * @param  dma_mask specifies the DMA request source(s) to enable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_UEDE
  *         @arg @ref LL_TIM_DIER_CC1DE
  *         @arg @ref LL_TIM_DIER_CC2DE
  */
__STATIC_INLINE void LL_LPTIM_EnableDMAReq(LPTIM_TypeDef *lptimx, uint32_t dma_mask)
{
  STM32_SET_BIT(lptimx->DIER, dma_mask);
}

/**
  * @brief  Indicate whether the DMA request(s) are enabled.
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_IsEnabledDMAReq \n
  *  DIER         CC1DE         LL_LPTIM_IsEnabledDMAReq \n
  *  DIER         CC2DE         LL_LPTIM_IsEnabledDMAReq
  * @param  lptimx Low-Power Timer instance
  * @param  dma_mask specifies the DMA request source(s) to enable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_UEDE
  *         @arg @ref LL_LPTIM_DIER_CC1DE
  *         @arg @ref LL_LPTIM_DIER_CC2DE
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledDMAReq(LPTIM_TypeDef *lptimx, uint32_t dma_mask)
{
  return ((((STM32_READ_REG(lptimx->DIER) & dma_mask) == dma_mask) ? 1UL : 0UL));
}

/**
  * @brief  Disable the selected DMA request(s).
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_DisableDMAReq \n
  *  DIER         CC1DE         LL_LPTIM_DisableDMAReq \n
  *  DIER         CC2DE         LL_LPTIM_DisableDMAReq
  * @param  lptimx Low-Power Timer instance
  * @param  dma_mask specifies the DMA request source(s) to disable.
  *         This parameter can be any combination of the following values:
  *         @arg @ref LL_LPTIM_DIER_UEDE
  *         @arg @ref LL_TIM_DIER_CC1DE
  *         @arg @ref LL_TIM_DIER_CC2DE
  */
__STATIC_INLINE void LL_LPTIM_DisableDMAReq(LPTIM_TypeDef *lptimx, uint32_t dma_mask)
{
  STM32_CLEAR_BIT(lptimx->DIER, dma_mask);
}

/**
  * @brief  Enable update DMA request.
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_EnableDMAReq_UPDATE
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableDMAReq_UPDATE(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_UEDE);
}

/**
  * @brief  Disable update DMA request.
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_DisableDMAReq_UPDATE
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableDMAReq_UPDATE(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_UEDE);
}

/**
  * @brief  Indicates whether the update DMA request is enabled.
  * @rmtoll
  *  DIER         UEDE          LL_LPTIM_IsEnabledDMAReq_UPDATE
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledDMAReq_UPDATE(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_UEDE) == (LPTIM_DIER_UEDE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 1 DMA request (CC1DE).
  * @rmtoll
  *  DIER         CC1DE         LL_LPTIM_EnableDMAReq_CC1
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableDMAReq_CC1(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC1DE);
}

/**
  * @brief  Disable capture/compare 1  DMA request (CC1DE).
  * @rmtoll
  *  DIER         CC1DE         LL_LPTIM_DisableDMAReq_CC1
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableDMAReq_CC1(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC1DE);
}

/**
  * @brief  Indicates whether the capture/compare 1 DMA request (CC1DE) is enabled.
  * @rmtoll
  *  DIER         CC1DE         LL_LPTIM_IsEnabledDMAReq_CC1
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledDMAReq_CC1(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC1DE) == (LPTIM_DIER_CC1DE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable capture/compare 2 DMA request (CC2DE).
  * @rmtoll
  *  DIER         CC2DE         LL_LPTIM_EnableDMAReq_CC2
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_EnableDMAReq_CC2(LPTIM_TypeDef *lptimx)
{
  STM32_SET_BIT(lptimx->DIER, LPTIM_DIER_CC2DE);
}

/**
  * @brief  Disable capture/compare 2  DMA request (CC2DE).
  * @rmtoll
  *  DIER         CC2DE         LL_LPTIM_DisableDMAReq_CC2
  * @param  lptimx Low-Power Timer instance
  */
__STATIC_INLINE void LL_LPTIM_DisableDMAReq_CC2(LPTIM_TypeDef *lptimx)
{
  STM32_CLEAR_BIT(lptimx->DIER, LPTIM_DIER_CC2DE);
}

/**
  * @brief  Indicates whether the capture/compare 2 DMA request (CC2DE) is enabled.
  * @rmtoll
  *  DIER         CC2DE         LL_LPTIM_IsEnabledDMAReq_CC2
  * @param  lptimx Low-Power Timer instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPTIM_IsEnabledDMAReq_CC2(const LPTIM_TypeDef *lptimx)
{
  return ((STM32_READ_BIT(lptimx->DIER, LPTIM_DIER_CC2DE) == (LPTIM_DIER_CC2DE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPTIM1 */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5xx_LL_LPTIM_H */
